base_files/cylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

10
(
    cyclic1
    {
        type    cyclic;
        inGroups    1(cyclic);
        neighbourPatch  cyclic2;
        nFaces          10954;
        startFace       18325;
    }
    cyclic2
    {
        type    cyclic;
        inGroups    1(cyclic);
        neighbourPatch  cyclic1;
        nFaces          10954;
        startFace       29279;
    }
    cylinder
    {
        type    wall;
        inGroups    1(wall);
        nFaces          152;
        startFace       40233;
    }
    jet3
    {
        type            patch;
        physicalType    patch;
        nFaces          1;
        startFace       40385;
    }
    jet2
    {
        type            patch;
        physicalType    patch;
        nFaces          1;
        startFace       40386;
    }
    jet1
    {
        type            patch;
        physicalType    patch;
        nFaces          1;
        startFace       40387;
    }
    jet4
    {
        type            patch;
        physicalType    patch;
        nFaces          1;
        startFace       40388;
    }
    wall
    {
        type    wall;
        inGroups    1(wall);
        nFaces          148;
        startFace       40389;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          24;
        startFace       40537;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          24;
        startFace       40561;
    }
)

// ************************************************************************* //
